7767517
277 339
Input                    in0                      0 1 in0
Convolution              conv_86                  1 1 in0 1 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864
Swish                    silu_19                  1 1 1 2
Convolution              conv_87                  1 1 2 3 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_20                  1 1 3 4
Convolution              conv_88                  1 1 4 5 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_21                  1 1 5 6
Slice                    tensor_split_0           1 2 6 7 8 -23300=2,32,-233 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_89                  1 1 11 12 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_22                  1 1 12 13
Convolution              conv_90                  1 1 13 14 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Split                    splitncnn_1              1 2 14 15 16
Sigmoid                  sigmoid_5                1 1 16 17
BinaryOp                 mul_0                    2 1 15 17 18 0=2
BinaryOp                 add_1                    2 1 10 18 19 0=0
Concat                   cat_0                    3 1 7 9 19 20 0=0
Convolution              conv_91                  1 1 20 21 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_23                  1 1 21 22
Convolution              conv_92                  1 1 22 23 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_24                  1 1 23 24
Convolution              conv_93                  1 1 24 25 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_25                  1 1 25 26
Slice                    tensor_split_1           1 2 26 27 28 -23300=2,64,-233 1=0
Split                    splitncnn_2              1 3 28 29 30 31
Convolution              conv_94                  1 1 31 32 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_26                  1 1 32 33
Convolution              conv_95                  1 1 33 34 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Split                    splitncnn_3              1 2 34 35 36
Sigmoid                  sigmoid_6                1 1 36 37
BinaryOp                 mul_2                    2 1 35 37 38 0=2
BinaryOp                 add_3                    2 1 30 38 39 0=0
Concat                   cat_1                    3 1 27 29 39 40 0=0
Convolution              conv_96                  1 1 40 41 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_27                  1 1 41 42
Split                    splitncnn_4              1 2 42 43 44
Convolution              conv_97                  1 1 44 45 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_28                  1 1 45 46
Convolution              conv_98                  1 1 46 47 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_29                  1 1 47 48
Slice                    tensor_split_2           1 2 48 49 50 -23300=2,128,-233 1=0
Split                    splitncnn_5              1 3 50 51 52 53
Convolution              conv_99                  1 1 53 54 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_30                  1 1 54 55
Split                    splitncnn_6              1 2 55 56 57
Convolution              conv_100                 1 1 57 58 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_31                  1 1 58 59
Convolution              conv_101                 1 1 59 60 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_7              1 2 60 61 62
Sigmoid                  sigmoid_7                1 1 62 63
BinaryOp                 mul_4                    2 1 61 63 64 0=2
BinaryOp                 add_5                    2 1 56 64 65 0=0
Split                    splitncnn_8              1 2 65 66 67
Convolution              conv_102                 1 1 67 68 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_32                  1 1 68 69
Convolution              conv_103                 1 1 69 70 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_9              1 2 70 71 72
Sigmoid                  sigmoid_8                1 1 72 73
BinaryOp                 mul_6                    2 1 71 73 74 0=2
BinaryOp                 add_7                    2 1 66 74 75 0=0
Convolution              conv_104                 1 1 52 76 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_33                  1 1 76 77
Concat                   cat_2                    2 1 75 77 78 0=0
Convolution              conv_105                 1 1 78 79 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_34                  1 1 79 80
Concat                   cat_3                    3 1 49 51 80 81 0=0
Convolution              conv_106                 1 1 81 82 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_35                  1 1 82 83
Split                    splitncnn_10             1 2 83 84 85
Convolution              conv_107                 1 1 85 86 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1179648
Swish                    silu_36                  1 1 86 87
Convolution              conv_108                 1 1 87 88 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_37                  1 1 88 89
Slice                    tensor_split_3           1 2 89 90 91 -23300=2,256,-233 1=0
Split                    splitncnn_11             1 3 91 92 93 94
Convolution              conv_109                 1 1 94 95 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_38                  1 1 95 96
Split                    splitncnn_12             1 2 96 97 98
Convolution              conv_110                 1 1 98 99 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_39                  1 1 99 100
Convolution              conv_111                 1 1 100 101 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_13             1 2 101 102 103
Sigmoid                  sigmoid_9                1 1 103 104
BinaryOp                 mul_8                    2 1 102 104 105 0=2
BinaryOp                 add_9                    2 1 97 105 106 0=0
Split                    splitncnn_14             1 2 106 107 108
Convolution              conv_112                 1 1 108 109 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_40                  1 1 109 110
Convolution              conv_113                 1 1 110 111 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_15             1 2 111 112 113
Sigmoid                  sigmoid_10               1 1 113 114
BinaryOp                 mul_10                   2 1 112 114 115 0=2
BinaryOp                 add_11                   2 1 107 115 116 0=0
Convolution              conv_114                 1 1 93 117 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_41                  1 1 117 118
Concat                   cat_4                    2 1 116 118 119 0=0
Convolution              conv_115                 1 1 119 120 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_42                  1 1 120 121
Concat                   cat_5                    3 1 90 92 121 122 0=0
Convolution              conv_116                 1 1 122 123 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_43                  1 1 123 124
Convolution              conv_117                 1 1 124 125 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_44                  1 1 125 126
Split                    splitncnn_16             1 2 126 127 128
Pooling                  maxpool2d_2              1 1 128 129 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_17             1 2 129 130 131
Pooling                  maxpool2d_3              1 1 131 132 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_18             1 2 132 133 134
Pooling                  maxpool2d_4              1 1 134 135 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_6                    4 1 127 130 133 135 136 0=0
Convolution              conv_118                 1 1 136 137 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_45                  1 1 137 138
Convolution              conv_119                 1 1 138 139 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_46                  1 1 139 140
Slice                    split_0                  1 2 140 141 142 -23300=2,256,256 1=0
Split                    splitncnn_19             1 2 142 143 144
Convolution              conv_120                 1 1 144 145 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Reshape                  reshape_168              1 1 145 146 0=400 1=128 2=4
Slice                    split_1                  1 3 146 147 148 149 -23300=3,32,32,64 1=1
Split                    splitncnn_20             1 2 149 150 151
Permute                  permute_166              1 1 147 152 0=1
MatMul                   matmul_174               2 1 152 148 153
BinaryOp                 mul_12                   1 1 153 154 0=2 1=1 2=0.176776692
Softmax                  softmax_85               1 1 154 155 0=2 1=1
MatMul                   matmultransb_0           2 1 151 155 156 0=1
Reshape                  reshape_169              1 1 156 157 0=20 1=20 2=256
Reshape                  reshape_170              1 1 150 158 0=20 1=20 2=256
ConvolutionDepthWise     convdw_179               1 1 158 159 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
BinaryOp                 add_13                   2 1 157 159 160 0=0
Convolution              conv_121                 1 1 160 161 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
BinaryOp                 add_14                   2 1 143 161 162 0=0
Split                    splitncnn_21             1 2 162 163 164
Convolution              conv_122                 1 1 164 165 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_47                  1 1 165 166
Convolution              conv_123                 1 1 166 167 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_15                   2 1 163 167 168 0=0
Concat                   cat_7                    2 1 141 168 169 0=0
Convolution              conv_124                 1 1 169 170 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_48                  1 1 170 171
Split                    splitncnn_22             1 2 171 172 173
Interp                   interpolate_0            1 1 173 174 0=1 1=2.0 2=2.0 6=0
Concat                   cat_8                    2 1 174 84 175 0=0
Convolution              conv_125                 1 1 175 176 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=196608
Swish                    silu_49                  1 1 176 177
Slice                    tensor_split_4           1 2 177 178 179 -23300=2,128,-233 1=0
Split                    splitncnn_23             1 3 179 180 181 182
Convolution              conv_126                 1 1 182 183 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_50                  1 1 183 184
Convolution              conv_127                 1 1 184 185 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Split                    splitncnn_24             1 2 185 186 187
Sigmoid                  sigmoid_11               1 1 187 188
BinaryOp                 mul_16                   2 1 186 188 189 0=2
BinaryOp                 add_17                   2 1 181 189 190 0=0
Concat                   cat_9                    3 1 178 180 190 191 0=0
Convolution              conv_128                 1 1 191 192 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_51                  1 1 192 193
Split                    splitncnn_25             1 2 193 194 195
Interp                   interpolate_1            1 1 195 196 0=1 1=2.0 2=2.0 6=0
Concat                   cat_10                   2 1 196 43 197 0=0
Convolution              conv_129                 1 1 197 198 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_52                  1 1 198 199
Slice                    tensor_split_5           1 2 199 200 201 -23300=2,64,-233 1=0
Split                    splitncnn_26             1 3 201 202 203 204
Convolution              conv_130                 1 1 204 205 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_53                  1 1 205 206
Convolution              conv_131                 1 1 206 207 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Split                    splitncnn_27             1 2 207 208 209
Sigmoid                  sigmoid_12               1 1 209 210
BinaryOp                 mul_18                   2 1 208 210 211 0=2
BinaryOp                 add_19                   2 1 203 211 212 0=0
Concat                   cat_11                   3 1 200 202 212 213 0=0
Convolution              conv_132                 1 1 213 214 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_54                  1 1 214 215
Split                    splitncnn_28             1 3 215 216 217 218
Convolution              conv_133                 1 1 217 219 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_55                  1 1 219 220
Concat                   cat_12                   2 1 220 194 221 0=0
Convolution              conv_134                 1 1 221 222 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_56                  1 1 222 223
Slice                    tensor_split_6           1 2 223 224 225 -23300=2,128,-233 1=0
Split                    splitncnn_29             1 3 225 226 227 228
Convolution              conv_135                 1 1 228 229 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_57                  1 1 229 230
Convolution              conv_136                 1 1 230 231 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Split                    splitncnn_30             1 2 231 232 233
Sigmoid                  sigmoid_13               1 1 233 234
BinaryOp                 mul_20                   2 1 232 234 235 0=2
BinaryOp                 add_21                   2 1 227 235 236 0=0
Concat                   cat_13                   3 1 224 226 236 237 0=0
Convolution              conv_137                 1 1 237 238 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_58                  1 1 238 239
Split                    splitncnn_31             1 3 239 240 241 242
Convolution              conv_138                 1 1 241 243 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_59                  1 1 243 244
Concat                   cat_14                   2 1 244 172 245 0=0
Convolution              conv_139                 1 1 245 246 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_60                  1 1 246 247
Slice                    tensor_split_7           1 2 247 248 249 -23300=2,256,-233 1=0
Split                    splitncnn_32             1 3 249 250 251 252
Convolution              conv_140                 1 1 252 253 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_61                  1 1 253 254
Split                    splitncnn_33             1 2 254 255 256
Convolution              conv_141                 1 1 256 257 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_62                  1 1 257 258
Convolution              conv_142                 1 1 258 259 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_34             1 2 259 260 261
Sigmoid                  sigmoid_14               1 1 261 262
BinaryOp                 mul_22                   2 1 260 262 263 0=2
BinaryOp                 add_23                   2 1 255 263 264 0=0
Split                    splitncnn_35             1 2 264 265 266
Convolution              conv_143                 1 1 266 267 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_63                  1 1 267 268
Convolution              conv_144                 1 1 268 269 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_36             1 2 269 270 271
Sigmoid                  sigmoid_15               1 1 271 272
BinaryOp                 mul_24                   2 1 270 272 273 0=2
BinaryOp                 add_25                   2 1 265 273 274 0=0
Convolution              conv_145                 1 1 251 275 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_64                  1 1 275 276
Concat                   cat_15                   2 1 274 276 277 0=0
Convolution              conv_146                 1 1 277 278 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_65                  1 1 278 279
Concat                   cat_16                   3 1 248 250 279 280 0=0
Convolution              conv_147                 1 1 280 281 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=393216
Swish                    silu_66                  1 1 281 282
Split                    splitncnn_37             1 2 282 283 284
Convolution              conv_148                 1 1 216 285 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_67                  1 1 285 286
Convolution              conv_149                 1 1 286 287 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_68                  1 1 287 288
Convolution              conv_150                 1 1 288 out0 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_180               1 1 218 290 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_69                  1 1 290 291
Convolution              conv_151                 1 1 291 292 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_70                  1 1 292 293
ConvolutionDepthWise     convdw_181               1 1 293 294 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_71                  1 1 294 295
Convolution              conv_152                 1 1 295 296 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_72                  1 1 296 297
Convolution              convsigmoid_0            1 1 297 298 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 9=4
Split                    splitncnn_38             1 2 298 out1 300
Reduction                sum_176                  1 1 300 301 0=0 1=0 -23303=1,0 4=1 5=1
Clip                     clamp_171                1 1 301 out2 0=0.0 1=1.0
Convolution              conv_154                 1 1 240 303 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_73                  1 1 303 304
Convolution              conv_155                 1 1 304 305 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_74                  1 1 305 306
Convolution              conv_156                 1 1 306 out3 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_182               1 1 242 308 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_75                  1 1 308 309
Convolution              conv_157                 1 1 309 310 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_76                  1 1 310 311
ConvolutionDepthWise     convdw_183               1 1 311 312 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_77                  1 1 312 313
Convolution              conv_158                 1 1 313 314 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_78                  1 1 314 315
Convolution              convsigmoid_1            1 1 315 316 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 9=4
Split                    splitncnn_39             1 2 316 out4 318
Reduction                sum_177                  1 1 318 319 0=0 1=0 -23303=1,0 4=1 5=1
Clip                     clamp_172                1 1 319 out5 0=0.0 1=1.0
Convolution              conv_160                 1 1 283 321 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Swish                    silu_79                  1 1 321 322
Convolution              conv_161                 1 1 322 323 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_80                  1 1 323 324
Convolution              conv_162                 1 1 324 out6 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_184               1 1 284 326 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Swish                    silu_81                  1 1 326 327
Convolution              conv_163                 1 1 327 328 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_82                  1 1 328 329
ConvolutionDepthWise     convdw_185               1 1 329 330 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_83                  1 1 330 331
Convolution              conv_164                 1 1 331 332 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_84                  1 1 332 333
Convolution              convsigmoid_2            1 1 333 334 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 9=4
Split                    splitncnn_40             1 2 334 out7 336
Reduction                sum_178                  1 1 336 337 0=0 1=0 -23303=1,0 4=1 5=1
Clip                     clamp_173                1 1 337 out8 0=0.0 1=1.0
